Revit 2027 API
BuiltInFailures.RegenFailures.CircularDependencyConstraintError Property
 Highlighted constraints cause a circular chain of references.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CircularDependencyConstraintError { get; }
Public Shared ReadOnly Property CircularDependencyConstraintError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CircularDependencyConstraintError {
	FailureDefinitionId^ get ();
}
static member CircularDependencyConstraintError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RegenFailures Class
Autodesk.Revit.DB Namespace